Revit 2025 API
ElectricalAnalyticalNodeType Enumeration
 The type of electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalAnalyticalNodeType
Public Enumeration ElectricalAnalyticalNodeType
public enum class ElectricalAnalyticalNodeType
type ElectricalAnalyticalNodeType
Members
Member name | Value | Description
PowerSource | 0 |  Power Source
Bus | 1 |  Bus
Transformer | 2 |  Transformer
TransferSwitch | 3 |  Transfer Switch
EquipmentLoad | 4 |  Equipment Load
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace